{
  "features": [
    {
      "category": "ui",
      "description": "The processing toast notification that appears during entry analysis should hide the X (close) button by default and only reveal it when the user hovers over the toast. This creates a cleaner visual appearance and reduces visual clutter while still allowing users to dismiss the toast when needed.",
      "technicalRequirements": [
        "Add CSS hover state to the toast component",
        "Set X button opacity to 0 by default",
        "Transition opacity to 1 on toast hover",
        "Use smooth transition animation (0.2s ease)",
        "Ensure the X button remains clickable when visible"
      ],
      "qaSteps": [
        "Navigate to settings page",
        "Trigger entry processing to show the toast",
        "Verify the toast appears",
        "Verify the X (close) button is NOT visible by default",
        "Hover over the toast",
        "Verify the X button becomes visible on hover",
        "Move mouse away from toast",
        "Verify the X button hides again"
      ],
      "passes": false
    },
    {
      "category": "ui",
      "description": "When a user clicks the X button to cancel the processing toast, the toast should display a loading/cancelling state before dismissing. This provides feedback that the cancellation is being processed rather than the toast immediately disappearing, which could feel abrupt or leave users uncertain if the action was registered.",
      "technicalRequirements": [
        "Add a 'cancelling' state to the toast component",
        "Show a spinner or loading indicator when cancelling",
        "Update toast text to 'Cancelling...' during this state",
        "Disable the X button while cancelling to prevent double-clicks",
        "Dismiss the toast after cancellation completes with smooth exit animation"
      ],
      "qaSteps": [
        "Navigate to settings page",
        "Trigger entry processing to show the toast",
        "Hover over the toast to reveal X button",
        "Click the X button to cancel",
        "Verify a loading indicator appears on the toast",
        "Verify the toast displays 'Cancelling...' or similar text",
        "Wait for cancellation to complete",
        "Verify the toast smoothly dismisses after loading completes"
      ],
      "passes": false
    },
    {
      "category": "architecture",
      "description": "All AI prompts used throughout the application should be extracted and centralized into a single prompts file. This makes it easier to review, edit, and maintain prompts in one location rather than having them scattered across multiple service files. It also enables easier prompt versioning and A/B testing in the future.",
      "technicalRequirements": [
        "Create a new file at src/ai/prompts.ts",
        "Export named constants for each prompt (e.g., CHAT_SYSTEM_PROMPT, INSIGHTS_ANALYSIS_PROMPT)",
        "Move the chat system prompt from services/ai.ts",
        "Move the insights analysis prompt from the analysis service",
        "Update all imports to use the centralized prompts file",
        "Use template literals or functions for prompts that need dynamic values",
        "Add comments describing each prompt's purpose"
      ],
      "qaSteps": [
        "Locate the new prompts file at src/ai/prompts.ts",
        "Verify the file exports all AI prompts used in the application",
        "Verify chat system prompt is defined in the prompts file",
        "Verify insights analysis prompt is defined in the prompts file",
        "Verify all prompt usages in the codebase import from this file",
        "Search codebase for hardcoded prompts outside the prompts file",
        "Verify no duplicate prompt definitions exist"
      ],
      "passes": true
    },
    {
      "category": "functional",
      "description": "The insights generated from journal entry analysis are currently too brief and lack context (e.g., 'external pressures from family and work'). Update the analysis prompt to instruct the LLM to generate richer, more detailed insight descriptions that provide meaningful context about the emotion or person mentioned.",
      "technicalRequirements": [
        "Update the insights analysis prompt to request more detailed descriptions",
        "Instruct the LLM to include context about why the emotion/person is significant",
        "Request the LLM to include relevant circumstances or triggers",
        "Set minimum description length guidelines in the prompt (1-2 sentences)"
      ],
      "qaSteps": [
        "Create an entry with rich content about emotions and people",
        "Trigger analysis on the entry",
        "Navigate to insights page",
        "Verify insights have more detailed descriptions than just a few words",
        "Verify emotion insights include context about triggers or circumstances",
        "Verify person insights include relationship context when mentioned",
        "Verify insights are 1-2 sentences providing meaningful context"
      ],
      "passes": false
    },
    {
      "category": "ui",
      "description": "When typing in the entry text editor, if the content exceeds the visible area, the user currently has to manually scroll to see what they're typing. The editor should automatically scroll to keep the cursor and current typing position visible, providing a seamless writing experience without interruption.",
      "technicalRequirements": [
        "Detect cursor position changes in the ContentEditableEditor",
        "Calculate if cursor is outside the visible viewport",
        "Implement scrollIntoView or equivalent for the cursor position",
        "Use smooth scrolling behavior for natural feel",
        "Handle both typing and cursor movement (arrow keys, click)",
        "Ensure scroll doesn't trigger on every keystroke, only when needed"
      ],
      "qaSteps": [
        "Navigate to entry editor",
        "Start typing content that exceeds the visible area",
        "Continue typing past the bottom of the visible text area",
        "Verify the view automatically scrolls to keep cursor visible",
        "Verify user does not need to manually scroll to see what they're typing",
        "Type multiple lines rapidly",
        "Verify scroll position keeps up with cursor position",
        "Verify smooth scrolling behavior without jarring jumps"
      ],
      "passes": false
    },
    {
      "category": "ui",
      "description": "The insights page currently has top and bottom margins that cause content to appear cut off when scrolling. The page should use padding instead of margins so that content smoothly scrolls off the edges of the screen without any visual clipping or harsh boundaries, creating a more polished scrolling experience.",
      "technicalRequirements": [
        "Replace margin with padding on the insights page container",
        "Ensure the scrollable container extends to the viewport edges",
        "Apply padding inside the scrollable area, not outside",
        "Test scroll behavior at top and bottom boundaries",
        "Maintain consistent spacing that works with the overall layout",
        "Ensure fix works on both desktop and mobile layouts"
      ],
      "qaSteps": [
        "Navigate to insights page with enough content to scroll",
        "Scroll down the page",
        "Verify content is NOT cut off at the top as you scroll",
        "Verify the page uses padding instead of margin for spacing",
        "Verify content smoothly scrolls off the top of the screen",
        "Verify content smoothly scrolls off the bottom of the screen",
        "Scroll to the very top",
        "Verify no visual clipping or harsh cutoff at boundaries"
      ],
      "passes": false
    },
    {
      "category": "ui",
      "description": "When filtering the insights page to show only emotions or only people, the grid cells currently expand to fill the available space. The grid should maintain consistent cell sizes regardless of the active filter, keeping the same visual appearance and layout whether showing all insights or a filtered subset.",
      "technicalRequirements": [
        "Set fixed or max-width on grid cells",
        "Use CSS grid with fixed column sizing (e.g., minmax or fixed widths)",
        "Prevent grid items from stretching with align-items or justify-items",
        "Ensure grid template remains consistent across filter states",
        "Test with varying amounts of content in each filter view"
      ],
      "qaSteps": [
        "Navigate to insights page with both emotions and people",
        "Note the grid cell sizes when showing all insights",
        "Click 'Emotions' filter to show only emotions",
        "Verify grid cells remain the same size as before filtering",
        "Verify cells do NOT expand to fill available space",
        "Click 'People' filter to show only people",
        "Verify grid cells remain the same consistent size",
        "Click 'All' to show everything again",
        "Verify grid returns to same layout"
      ],
      "passes": false
    },
    {
      "category": "ui",
      "description": "The filter buttons (All, Emotions, People) on the insights page should have distinct background colors to help users quickly identify which filter type they're selecting. Each filter category should use a consistent color that reinforces the visual language of the app.",
      "technicalRequirements": [
        "Define background colors for each filter button in the theme",
        "Apply distinct background color to the Emotions filter button",
        "Apply different distinct background color to the People filter button",
        "Ensure colors work in both light and dark themes",
        "Use colors that are visible but not overwhelming",
        "Ensure sufficient contrast for accessibility",
        "Maintain visual consistency with overall app design"
      ],
      "qaSteps": [
        "Navigate to insights page",
        "Verify the Emotions filter button has a distinct background color",
        "Verify the People filter button has a different distinct background color",
        "Verify the All filter button has appropriate styling",
        "Verify the filter button colors are consistent with the app's theme",
        "Toggle to dark mode if available",
        "Verify filter button colors work well in dark mode",
        "Verify the filter buttons look cohesive and intentional"
      ],
      "passes": false
    }
  ]
}
